app/controllers/books_controller.rb

INSERT INTO "books" ("title", "author", "price", "date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "test"], ["author", "test2"], ["price", 2.2], ["date", "2021-09-30"], ["created_at", "2021-09-30 15:33:55.654224"], ["updated_at", "2021-09-30 15:33:55.654224"]]
---
  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save